# ======================================================================
# Напишите программу, которая получает целое число num и возвращает
# его шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.
# ======================================================================


num = 0


def int_to_hex(num):
    return hex(num)[2:]


def int_to_hex_format(num):
    if num == 0:  # костыль, который вместо нуля выдает пробел
        return ''
    else:
        return format(num, 'X')


hex_num = int_to_hex(num)
hex_num_format = int_to_hex_format(num)

print(f"Шестнадцатеричное представление числа: {hex_num_format}")
print(f"Проверка результата: 0x{hex_num}")
